## Import needed Libs

In [18]:
import pandas as pd
import numpy as np

## Laden und mit den Daten spielen

In [25]:
df = pd.read_csv('../Daten/autoscout24-germany-dataset.csv')

print(df.shape)

df.head(7)

(46405, 9)

,mileage,make,model,fuel,gear,offerType,price,hp,year
0,235000,BMW,316,Diesel,Manual,Used,6800,116.0,2011
1,92800,Volkswagen,Golf,Gasoline,Manual,Used,6877,122.0,2011
2,149300,SEAT,Exeo,Gasoline,Manual,Used,6900,160.0,2011
3,96200,Renault,Megane,Gasoline,Manual,Used,6950,110.0,2011
4,156000,Peugeot,308,Gasoline,Manual,Used,6950,156.0,2011
5,147000,Toyota,Auris,Electric/Gasoline,Automatic,Used,6950,99.0,2011
6,91894,Renault,Scenic,Diesel,Manual,Used,6970,131.0,2011

## Zählen na und doppelten Daten (um sie später zu entfernen)

In [26]:
print(f"There is: {df.isnull().sum().sum()} missing values in the dataset")

print(f"There is: {df.duplicated().sum()} duplicates in the dataset")

There is: 354 missing values in the dataset
There is: 2140 duplicates in the dataset

# Datenbereinigung

In [27]:
# Entfernen von doppelten und fehlenden Daten

df.drop_duplicates(inplace=True)
df.dropna(inplace=True)

## Daten nach Bereinigung

In [29]:
print(df.shape)

df.info

(43947, 9)

<bound method DataFrame.info of        mileage        make   model               fuel    gear       offerType  \
0       235000         BMW     316             Diesel  Manual            Used
1        92800  Volkswagen    Golf           Gasoline  Manual            Used
2       149300        SEAT    Exeo           Gasoline  Manual            Used
3        96200     Renault  Megane           Gasoline  Manual            Used
4       156000     Peugeot     308           Gasoline  Manual            Used
...        ...         ...     ...                ...     ...             ...
46394       10     Citroen      C1           Gasoline  Manual  Pre-registered
46396       99        Fiat     500  Electric/Gasoline  Manual  Pre-registered
46397      550        Fiat     500  Electric/Gasoline  Manual   Demonstration
46398      837        Fiat   Panda  Electric/Gasoline  Manual   Demonstration
46399     1500       Skoda   Fabia           Gasoline  Manual   Demonstration

       price     hp  year
0       6800  116.0  2011
1       6877  122.0  2011
2       6900  160.0  2011
3       6950  110.0  2011
4       6950  156.0  2011
...      ...    ...   ...
46394  12340   72.0  2021
46396  12490   71.0  2021
46397  12805   69.0  2021
46398  12805   69.0  2021
46399  12980   60.0  2021

[43947 rows x 9 columns]>

## Die Fahrzeugtypen (Gear)

In [30]:
gear = df['gear'].value_counts();
gear.head()

gear
Manual            28752
Automatic         15141
Semi-automatic       54
Name: count, dtype: int64

## Teuersten Autos auf dem deutschen Automarkt

In [32]:
teuer_autos = df[['make', 'model', 'price']].sort_values('price', ascending=False).head(10)
teuer_autos

                make      model    price
21675        Ferrari        F12  1199900
11753        Maybach    Pullman   717078
11754  Mercedes-Benz      S 650   717078
16429        Maybach    Pullman   499800
29257  Mercedes-Benz        SLS   465000
7384     Lamborghini  Aventador   449900
7383     Lamborghini  Aventador   439900
18419        Ferrari        812   439900
2170     Lamborghini  Aventador   399999
42132        Porsche        991   399911

## Gesamtzahl der Fahrzeuge je Hersteller

In [33]:
df['make'].value_counts()

make
Volkswagen    6680
Opel          4576
Ford          4245
Skoda         2737
Renault       2659
              ...
Brilliance       1
Others           1
FISKER           1
Isuzu            1
Alpine           1
Name: count, Length: 71, dtype: int64